[{"name": "admin@338", "url": "https://attack.mitre.org/groups/G0018", "source_keyword": "mitre-groups", "info": {"decription": "\nadmin@338 is a China-based cyber threat group. It has previously used newsworthy events as lures to deliver malware and has primarily targeted organizations involved in financial, economic, and trade policy, typically using publicly available RATs such as PoisonIvy, as well as some non-public backdoors. [1]\n", "ID": "G0018", "Contributors": "Tatsuya Daitoku, Cyber Defense Institute, Inc.", "Version": "1.1", "Created": "31 May 2017", "Last Modified": "04 September 2019"}}, {"name": "APT1", "url": "https://attack.mitre.org/groups/G0006", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT1 is a Chinese threat group that has been attributed to the 2nd Bureau of the People’s Liberation Army (PLA) General Staff Department’s (GSD) 3rd Department, commonly known by its Military Unit Cover Designator (MUCD) as Unit 61398. [1]\n", "ID": "G0006", "Associated Groups": "Comment Crew, Comment Group, Comment Panda", "Version": "1.1", "Created": "31 May 2017", "Last Modified": "20 August 2019"}}, {"name": "APT12", "url": "https://attack.mitre.org/groups/G0005", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT12 is a threat group that has been attributed to China. The group has targeted a variety of victims including but not limited to media outlets, high-tech companies, and multiple governments.[1]\n", "ID": "G0005", "Associated Groups": "IXESHE, DynCalc, Numbered Panda, DNSCALC", "Version": "2.0", "Created": "31 May 2017", "Last Modified": "10 June 2019"}}, {"name": "APT16", "url": "https://attack.mitre.org/groups/G0023", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT16 is a China-based threat group that has launched spearphishing campaigns targeting Japanese and Taiwanese organizations. [1]\n", "ID": "G0023", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "22 March 2019"}}, {"name": "APT17", "url": "https://attack.mitre.org/groups/G0025", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT17 is a China-based threat group that has conducted network intrusions against U.S. government entities, the defense industry, law firms, information technology companies, mining companies, and non-government organizations. [1]\n", "ID": "G0025", "Associated Groups": "Deputy Dog", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "22 March 2019"}}, {"name": "APT18", "url": "https://attack.mitre.org/groups/G0026", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT18 is a threat group that has operated since at least 2009 and has targeted a range of industries, including technology, manufacturing, human rights groups, government, and medical. [1]\n", "ID": "G0026", "Associated Groups": "TG-0416, Dynamite Panda, Threat Group-0416", "Version": "2.0", "Created": "31 May 2017", "Last Modified": "30 May 2019"}}, {"name": "APT19", "url": "https://attack.mitre.org/groups/G0073", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT19 is a Chinese-based threat group that has targeted a variety of industries, including defense, finance, energy, pharmaceutical, telecommunications, high tech, education, manufacturing, and legal services. In 2017, a phishing campaign was used to target seven law and investment firms. [1] Some analysts track APT19 and Deep Panda as the same group, but it is unclear from open source information if the groups are the same. [2] [3] [4]\n", "ID": "G0073", "Associated Groups": "Codoso, C0d0so0, Codoso Team, Sunshop Group", "Contributors": "FS-ISAC, Darren Spruell", "Version": "1.2", "Created": "17 October 2018", "Last Modified": "11 October 2019"}}, {"name": "APT28", "url": "https://attack.mitre.org/groups/G0007", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT28 is a threat group that has been attributed to Russia's Main Intelligence Directorate of the Russian General Staff by a July 2018 U.S. Department of Justice indictment. This group reportedly compromised the Hillary Clinton campaign, the Democratic National Committee, and the Democratic Congressional Campaign Committee in 2016 in an attempt to interfere with the U.S. presidential election. APT28 has been active since at least 2004.[1] [2] [3] [4] [5] [6] [7] [8] [9] [10] [11]\n", "ID": "G0007", "Associated Groups": "SNAKEMACKEREL, Swallowtail, Group 74, Sednit, Sofacy, Pawn Storm, Fancy Bear, STRONTIUM, Tsar Team, Threat Group-4127, TG-4127", "Contributors": "Drew Church, Splunk, Emily Ratliff, IBM, Richard Gold, Digital Shadows", "Version": "2.2", "Created": "31 May 2017", "Last Modified": "11 October 2019"}}, {"name": "APT29", "url": "https://attack.mitre.org/groups/G0016", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT29 is threat group that has been attributed to the Russian government and has operated since at least 2008. [1] [2] This group reportedly compromised the Democratic National Committee starting in the summer of 2015. [3]\n", "ID": "G0016", "Associated Groups": "YTTRIUM, The Dukes, Cozy Bear, CozyDuke", "Version": "1.2", "Created": "31 May 2017", "Last Modified": "25 July 2019"}}, {"name": "APT3", "url": "https://attack.mitre.org/groups/G0022", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT3 is a China-based threat group that researchers have attributed to China's Ministry of State Security. [1] [2] This group is responsible for the campaigns known as Operation Clandestine Fox, Operation Clandestine Wolf, and Operation Double Tap. [1] [3] As of June 2015, the group appears to have shifted from targeting primarily US victims to primarily political organizations in Hong Kong. [4]\nMITRE has also developed an APT3 Adversary Emulation Plan.[5]\n", "ID": "G0022", "Associated Groups": "Gothic Panda, Pirpi, UPS Team, Buckeye, Threat Group-0110, TG-0110", "Version": "1.2", "Created": "31 May 2017", "Last Modified": "11 October 2019"}}, {"name": "APT30", "url": "https://attack.mitre.org/groups/G0013", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT30 is a threat group suspected to be associated with the Chinese government. [1] While Naikon shares some characteristics with APT30, the two groups do not appear to be exact matches. [2]\n", "ID": "G0013", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "22 March 2019"}}, {"name": "APT32", "url": "https://attack.mitre.org/groups/G0050", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT32 is a threat group that has been active since at least 2014. The group has targeted multiple private sector industries as well as with foreign governments, dissidents, and journalists with a strong focus on Southeast Asian countries like Vietnam, the Philippines, Laos, and Cambodia. They have extensively used strategic web compromises to compromise victims. The group is believed to be Vietnam-based. [1] [2] [3]\n", "ID": "G0050", "Associated Groups": "SeaLotus, OceanLotus, APT-C-00", "Contributors": "Romain Dumont, ESET", "Version": "2.1", "Created": "14 December 2017", "Last Modified": "14 October 2019"}}, {"name": "APT33", "url": "https://attack.mitre.org/groups/G0064", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT33 is a suspected Iranian threat group that has carried out operations since at least 2013. The group has targeted organizations across multiple industries in the United States, Saudi Arabia, and South Korea, with a particular interest in the aviation and energy sectors. [1] [2]\n", "ID": "G0064", "Associated Groups": "Elfin", "Version": "1.2", "Created": "18 April 2018", "Last Modified": "28 June 2019"}}, {"name": "APT37", "url": "https://attack.mitre.org/groups/G0067", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT37 is a suspected North Korean cyber espionage group that has been active since at least 2012. The group has targeted victims primarily in South Korea, but also in Japan, Vietnam, Russia, Nepal, China, India, Romania, Kuwait, and other parts of the Middle East. APT37 has also been linked to following campaigns between 2016-2018: Operation Daybreak, Operation Erebus, Golden Time, Evil New Year, Are you Happy?, FreeMilk, Northern Korean Human Rights, and Evil New Year 2018. [1] [2] [3]\nNorth Korean group definitions are known to have significant overlap, and the name Lazarus Group is known to encompass a broad range of activity. Some organizations use the name Lazarus Group to refer to any activity attributed to North Korea.[4] Some organizations track North Korean clusters or groups such as Bluenoroff,[5] APT37, and APT38 separately, while other organizations may track some activity associated with those group names by the name Lazarus Group.\n", "ID": "G0067", "Associated Groups": "ScarCruft, Reaper, Group123, TEMP.Reaper", "Contributors": "Valerii Marchuk, Cybersecurity Help s.r.o.", "Version": "1.3", "Created": "18 April 2018", "Last Modified": "04 October 2019"}}, {"name": "APT38", "url": "https://attack.mitre.org/groups/G0082", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT38 is a financially-motivated threat group that is backed by the North Korean regime. The group mainly targets banks and financial institutions and has targeted more than 16 organizations in at least 13 countries since at least 2014.[1]\nNorth Korean group definitions are known to have significant overlap, and the name Lazarus Group is known to encompass a broad range of activity. Some organizations use the name Lazarus Group to refer to any activity attributed to North Korea.[2] Some organizations track North Korean clusters or groups such as Bluenoroff,[3] APT37, and APT38 separately, while other organizations may track some activity associated with those group names by the name Lazarus Group.\n", "ID": "G0082", "Version": "1.1", "Created": "29 January 2019", "Last Modified": "04 October 2019"}}, {"name": "APT39", "url": "https://attack.mitre.org/groups/G0087", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT39 is an Iranian cyber espionage group that has been active since at least 2014. They have targeted the telecommunication and travel industries to collect personal information that aligns with Iran's national priorities. [1][2]\n", "ID": "G0087", "Associated Groups": "Chafer", "Version": "2.0", "Created": "19 February 2019", "Last Modified": "29 April 2019"}}, {"name": "APT41", "url": "https://attack.mitre.org/groups/G0096", "source_keyword": "mitre-groups", "info": {"decription": "\nAPT41 is a group that carries out Chinese state-sponsored espionage activity in addition to financially motivated activity. APT41 has been active since as early as 2012. The group has been observed targeting healthcare, telecom, technology, and video game industries in 14 countries.[1]\n", "ID": "G0096", "Version": "1.0", "Created": "23 September 2019", "Last Modified": "14 October 2019"}}, {"name": "Axiom", "url": "https://attack.mitre.org/groups/G0001", "source_keyword": "mitre-groups", "info": {"decription": "\nAxiom is a cyber espionage group suspected to be associated with the Chinese government. It is responsible for the Operation SMN campaign. [1] Though both this group and Winnti Group use the malware Winnti, the two groups appear to be distinct based on differences in reporting on the groups' TTPs and targeting. [2] [3] [4]\n", "ID": "G0001", "Associated Groups": "Group 72", "Version": "1.1", "Created": "31 May 2017", "Last Modified": "24 September 2019"}}, {"name": "BlackOasis", "url": "https://attack.mitre.org/groups/G0063", "source_keyword": "mitre-groups", "info": {"decription": "\nBlackOasis is a Middle Eastern threat group that is believed to be a customer of Gamma Group. The group has shown interest in prominent figures in the United Nations, as well as opposition bloggers, activists, regional news correspondents, and think tanks. [1] [2] A group known by Microsoft as NEODYMIUM is reportedly associated closely with BlackOasis operations, but evidence that the group names are aliases has not been identified. [3]\n", "ID": "G0063", "Version": "1.0", "Created": "18 April 2018", "Last Modified": "17 October 2018"}}, {"name": "BRONZE BUTLER", "url": "https://attack.mitre.org/groups/G0060", "source_keyword": "mitre-groups", "info": {"decription": "\nBRONZE BUTLER is a cyber espionage group with likely Chinese origins that has been active since at least 2008. The group primarily targets Japanese organizations, particularly those in government, biotechnology, electronics manufacturing, and industrial chemistry. [1] [2]\n", "ID": "G0060", "Associated Groups": "REDBALDKNIGHT, Tick", "Version": "1.0", "Created": "16 January 2018", "Last Modified": "22 March 2019"}}, {"name": "Carbanak", "url": "https://attack.mitre.org/groups/G0008", "source_keyword": "mitre-groups", "info": {"decription": "\nCarbanak is a threat group that mainly targets banks. It also refers to malware of the same name (Carbanak). It is sometimes referred to as FIN7, but these appear to be two groups using the same Carbanak malware and are therefore tracked separately. [1] [2]\n", "ID": "G0008", "Associated Groups": "Anunak, Carbon Spider", "Contributors": "Anastasios Pingios", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "22 March 2019"}}, {"name": "Charming Kitten", "url": "https://attack.mitre.org/groups/G0058", "source_keyword": "mitre-groups", "info": {"decription": "\nCharming Kitten is an Iranian cyber espionage group that has been active since approximately 2014. They appear to focus on targeting individuals of interest to Iran who work in academic research, human rights, and media, with most victims having been located in Iran, the US, Israel, and the UK. Charming Kitten usually tries to access private email and Facebook accounts, and sometimes establishes a foothold on victim computers as a secondary objective. The group's TTPs overlap extensively with another group, Magic Hound, resulting in reporting that may not distinguish between the two groups' activities. [1]\n", "ID": "G0058", "Version": "1.0", "Created": "16 January 2018", "Last Modified": "22 March 2019"}}, {"name": "Cleaver", "url": "https://attack.mitre.org/groups/G0003", "source_keyword": "mitre-groups", "info": {"decription": "\nCleaver is a threat group that has been attributed to Iranian actors and is responsible for activity tracked as Operation Cleaver. [1] Strong circumstantial evidence suggests Cleaver is linked to Threat Group 2889 (TG-2889). [2]\n", "ID": "G0003", "Associated Groups": "Threat Group 2889, TG-2889", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "22 March 2019"}}, {"name": "Cobalt Group", "url": "https://attack.mitre.org/groups/G0080", "source_keyword": "mitre-groups", "info": {"decription": "\nCobalt Group is a financially motivated threat group that has primarily targeted financial institutions. The group has conducted intrusions to steal money via targeting ATM systems, card processing, payment systems and SWIFT systems. Cobalt Group has mainly targeted banks in Eastern Europe, Central Asia, and Southeast Asia. One of the alleged leaders was arrested in Spain in early 2018, but the group still appears to be active. The group has been known to target organizations in order to use their access to then compromise additional victims. [1] [2] [3] [4] [5] [6] [7] Reporting indicates there may be links between Cobalt Group and both the malware Carbanak and the group Carbanak. [8]\n", "ID": "G0080", "Associated Groups": "Cobalt Gang, Cobalt Spider", "Version": "1.1", "Created": "17 October 2018", "Last Modified": "26 July 2019"}}, {"name": "CopyKittens", "url": "https://attack.mitre.org/groups/G0052", "source_keyword": "mitre-groups", "info": {"decription": "\nCopyKittens is an Iranian cyber espionage group that has been operating since at least 2013. It has targeted countries including Israel, Saudi Arabia, Turkey, the U.S., Jordan, and Germany. The group is responsible for the campaign known as Operation Wilted Tulip. [1] [2] [3]\n", "ID": "G0052", "Version": "1.2", "Created": "16 January 2018", "Last Modified": "11 October 2019"}}, {"name": "Dark Caracal", "url": "https://attack.mitre.org/groups/G0070", "source_keyword": "mitre-groups", "info": {"decription": "\nDark Caracal is threat group that has been attributed to the Lebanese General Directorate of General Security (GDGS) and has operated since at least 2012. [1]\n", "ID": "G0070", "Version": "1.1", "Created": "17 October 2018", "Last Modified": "16 July 2019"}}, {"name": "Darkhotel", "url": "https://attack.mitre.org/groups/G0012", "source_keyword": "mitre-groups", "info": {"decription": "\nDarkhotel is a threat group that has been active since at least 2004. The group has conducted activity on hotel and business center Wi‑Fi and physical connections as well as peer-to-peer and file sharing networks. The actors have also conducted spearphishing. [1]\n", "ID": "G0012", "Version": "1.1", "Created": "31 May 2017", "Last Modified": "31 January 2019"}}, {"name": "DarkHydrus", "url": "https://attack.mitre.org/groups/G0079", "source_keyword": "mitre-groups", "info": {"decription": "\nDarkHydrus is a threat group that has targeted government agencies and educational institutions in the Middle East since at least 2016. The group heavily leverages open-source tools and custom payloads for carrying out attacks. [1] [2]\n", "ID": "G0079", "Version": "1.1", "Created": "17 October 2018", "Last Modified": "11 October 2019"}}, {"name": "Deep Panda", "url": "https://attack.mitre.org/groups/G0009", "source_keyword": "mitre-groups", "info": {"decription": "\nDeep Panda is a suspected Chinese threat group known to target many industries, including government, defense, financial, and telecommunications. [1] The intrusion into healthcare company Anthem has been attributed to Deep Panda. [2] This group is also known as Shell Crew, WebMasters, KungFu Kittens, and PinkPanther. [3] Deep Panda also appears to be known as Black Vine based on the attribution of both group names to the Anthem intrusion. [4] Some analysts track Deep Panda and APT19 as the same group, but it is unclear from open source information if the groups are the same. [5]\n", "ID": "G0009", "Associated Groups": "Shell Crew, WebMasters, KungFu Kittens, PinkPanther, Black Vine", "Contributors": "Andrew Smith, @jakx_", "Version": "1.1", "Created": "31 May 2017", "Last Modified": "11 October 2019"}}, {"name": "Dragonfly", "url": "https://attack.mitre.org/groups/G0035", "source_keyword": "mitre-groups", "info": {"decription": "\nDragonfly is a cyber espionage group that has been active since at least 2011. They initially targeted defense and aviation companies but shifted to focus on the energy sector in early 2013. They have also targeted companies related to industrial control systems. [1]\nA similar group emerged in 2015 and was identified by Symantec as Dragonfly 2.0. There is debate over the extent of the overlap between Dragonfly and Dragonfly 2.0, but there is sufficient evidence to lead to these being tracked as two separate groups. [2] [3]\n", "ID": "G0035", "Associated Groups": "Energetic Bear", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "22 March 2019"}}, {"name": "Dragonfly 2.0", "url": "https://attack.mitre.org/groups/G0074", "source_keyword": "mitre-groups", "info": {"decription": "\nDragonfly 2.0 is a suspected Russian group that has targeted government entities and multiple U.S. critical infrastructure sectors since at least March 2016. [1] [2] There is debate over the extent of overlap between Dragonfly 2.0 and Dragonfly, but there is sufficient evidence to lead to these being tracked as two separate groups. [3]\n", "ID": "G0074", "Associated Groups": "Berserk Bear", "Version": "1.1", "Created": "17 October 2018", "Last Modified": "22 March 2019"}}, {"name": "DragonOK", "url": "https://attack.mitre.org/groups/G0017", "source_keyword": "mitre-groups", "info": {"decription": "\nDragonOK is a threat group that has targeted Japanese organizations with phishing emails. Due to overlapping TTPs, including similar custom tools, DragonOK is thought to have a direct or indirect relationship with the threat group Moafee. [1] It is known to use a variety of malware, including Sysget/HelloBridge, PlugX, PoisonIvy, FormerFirstRat, NFlog, and NewCT. [2]\n", "ID": "G0017", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "22 March 2019"}}, {"name": "Dust Storm", "url": "https://attack.mitre.org/groups/G0031", "source_keyword": "mitre-groups", "info": {"decription": "\nDust Storm is a threat group that has targeted multiple industries in Japan, South Korea, the United States, Europe, and several Southeast Asian countries. [1]\n", "ID": "G0031", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "22 March 2019"}}, {"name": "Elderwood", "url": "https://attack.mitre.org/groups/G0066", "source_keyword": "mitre-groups", "info": {"decription": "\nElderwood is a suspected Chinese cyber espionage group that was reportedly responsible for the 2009 Google intrusion known as Operation Aurora. [1] The group has targeted defense organizations, supply chain manufacturers, human rights and nongovernmental organizations (NGOs), and IT service providers. [2] [3]\n", "ID": "G0066", "Associated Groups": "Elderwood Gang, Beijing Group, Sneaky Panda", "Contributors": "Valerii Marchuk, Cybersecurity Help s.r.o.", "Version": "1.0", "Created": "18 April 2018", "Last Modified": "22 March 2019"}}, {"name": "Equation", "url": "https://attack.mitre.org/groups/G0020", "source_keyword": "mitre-groups", "info": {"decription": "\nEquation is a sophisticated threat group that employs multiple remote access tools. The group is known to use zero-day exploits and has developed the capability to overwrite the firmware of hard disk drives. [1]\n", "ID": "G0020", "Version": "1.1", "Created": "31 May 2017", "Last Modified": "31 January 2019"}}, {"name": "FIN10", "url": "https://attack.mitre.org/groups/G0051", "source_keyword": "mitre-groups", "info": {"decription": "\nFIN10 is a financially motivated threat group that has targeted organizations in North America since at least 2013 through 2016. The group uses stolen data exfiltrated from victims to extort organizations. [1]\n", "ID": "G0051", "Version": "1.1", "Created": "14 December 2017", "Last Modified": "25 April 2019"}}, {"name": "FIN4", "url": "https://attack.mitre.org/groups/G0085", "source_keyword": "mitre-groups", "info": {"decription": "\nFIN4 is a financially-motivated threat group that has targeted confidential information related to the public financial market, particularly regarding healthcare and pharmaceutical companies, since at least 2013.[1][2] FIN4 is unique in that they do not infect victims with typical persistent malware, but rather they focus on capturing credentials authorized to access email and other non-public correspondence.[1][3]\n", "ID": "G0085", "Version": "1.0", "Created": "31 January 2019", "Last Modified": "18 April 2019"}}, {"name": "FIN5", "url": "https://attack.mitre.org/groups/G0053", "source_keyword": "mitre-groups", "info": {"decription": "\nFIN5 is a financially motivated threat group that has targeted personally identifiable information and payment card information. The group has been active since at least 2008 and has targeted the restaurant, gaming, and hotel industries. The group is made up of actors who likely speak Russian. [1] [2] [3]\n", "ID": "G0053", "Contributors": "Walker Johnson", "Version": "1.0", "Created": "16 January 2018", "Last Modified": "24 April 2019"}}, {"name": "FIN6", "url": "https://attack.mitre.org/groups/G0037", "source_keyword": "mitre-groups", "info": {"decription": "\nFIN6 is a cyber crime group that has stolen payment card data and sold it for profit on underground marketplaces. This group has aggressively targeted and compromised point of sale (PoS) systems in the hospitality and retail sectors.[1][2]\n", "ID": "G0037", "Associated Groups": "ITG08", "Contributors": "Drew Church, Splunk", "Version": "2.0", "Created": "31 May 2017", "Last Modified": "15 October 2019"}}, {"name": "FIN7", "url": "https://attack.mitre.org/groups/G0046", "source_keyword": "mitre-groups", "info": {"decription": "\nFIN7 is a financially-motivated threat group that has primarily targeted the U.S. retail, restaurant, and hospitality sectors since mid-2015. They often use point-of-sale malware. A portion of FIN7 was run out of a front company called Combi Security. FIN7 is sometimes referred to as Carbanak Group, but these appear to be two groups using the same Carbanak malware and are therefore tracked separately. [1] [2] [3] [4]\n", "ID": "G0046", "Version": "1.3", "Created": "31 May 2017", "Last Modified": "15 October 2019"}}, {"name": "FIN8", "url": "https://attack.mitre.org/groups/G0061", "source_keyword": "mitre-groups", "info": {"decription": "\nFIN8 is a financially motivated threat group known to launch tailored spearphishing campaigns targeting the retail, restaurant, and hospitality industries. [1] [2]\n", "ID": "G0061", "Version": "1.0", "Created": "18 April 2018", "Last Modified": "01 October 2019"}}, {"name": "Gallmaker", "url": "https://attack.mitre.org/groups/G0084", "source_keyword": "mitre-groups", "info": {"decription": "\nGallmaker is a cyberespionage group that has targeted victims in the Middle East and has been active since at least December 2017. The group has mainly targeted victims in the defense, military, and government sectors.[1]\n", "ID": "G0084", "Version": "1.0", "Created": "30 January 2019", "Last Modified": "16 April 2019"}}, {"name": "Gamaredon Group", "url": "https://attack.mitre.org/groups/G0047", "source_keyword": "mitre-groups", "info": {"decription": "\nGamaredon Group is a threat group that has been active since at least 2013 and has targeted individuals likely involved in the Ukrainian government. [1]\n", "ID": "G0047", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "GCMAN", "url": "https://attack.mitre.org/groups/G0036", "source_keyword": "mitre-groups", "info": {"decription": "\nGCMAN is a threat group that focuses on targeting banks for the purpose of transferring money to e-currency services. [1]\n", "ID": "G0036", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "17 October 2018"}}, {"name": "Gorgon Group", "url": "https://attack.mitre.org/groups/G0078", "source_keyword": "mitre-groups", "info": {"decription": "\nGorgon Group is a threat group consisting of members who are suspected to be Pakistan-based or have other connections to Pakistan. The group has performed a mix of criminal and targeted attacks, including campaigns against government organizations in the United Kingdom, Spain, Russia, and the United States. [1]\n", "ID": "G0078", "Version": "1.3", "Created": "17 October 2018", "Last Modified": "11 October 2019"}}, {"name": "Group5", "url": "https://attack.mitre.org/groups/G0043", "source_keyword": "mitre-groups", "info": {"decription": "\nGroup5 is a threat group with a suspected Iranian nexus, though this attribution is not definite. The group has targeted individuals connected to the Syrian opposition via spearphishing and watering holes, normally using Syrian and Iranian themes. Group5 has used two commonly available remote access tools (RATs), njRAT and NanoCore, as well as an Android RAT, DroidJack. [1]\n", "ID": "G0043", "Version": "1.1", "Created": "31 May 2017", "Last Modified": "25 July 2019"}}, {"name": "Honeybee", "url": "https://attack.mitre.org/groups/G0072", "source_keyword": "mitre-groups", "info": {"decription": "\nHoneybee is a campaign led by an unknown actor that targets humanitarian aid organizations and has been active in Vietnam, Singapore, Argentina, Japans, Indonesia, and Canada. It has been an active operation since August of 2017 and as recently as February 2018. [1]\n", "ID": "G0072", "Version": "1.0", "Created": "17 October 2018", "Last Modified": "25 March 2019"}}, {"name": "Ke3chang", "url": "https://attack.mitre.org/groups/G0004", "source_keyword": "mitre-groups", "info": {"decription": "\nKe3chang is a threat group attributed to actors operating out of China.\nKe3chang has targeted several industries, including oil, government, military, and more. [1] [2] [3]\n", "ID": "G0004", "Associated Groups": "APT15, Mirage, Vixen Panda, GREF, Playful Dragon, RoyalAPT", "Version": "1.1", "Created": "31 May 2017", "Last Modified": "22 April 2019"}}, {"name": "Kimsuky", "url": "https://attack.mitre.org/groups/G0094", "source_keyword": "mitre-groups", "info": {"decription": "\nKimsuky is a North Korean-based threat group that has been active since at least September 2013. The group focuses on targeting Korean think tank as well as DPRK/nuclear-related targets. The group was attributed as the actor behind the Korea Hydro & Nuclear Power Co. compromise.[1][2]\n", "ID": "G0094", "Associated Groups": "Velvet Chollima", "Version": "1.0", "Created": "26 August 2019", "Last Modified": "07 October 2019"}}, {"name": "Lazarus Group", "url": "https://attack.mitre.org/groups/G0032", "source_keyword": "mitre-groups", "info": {"decription": "\nLazarus Group is a threat group that has been attributed to the North Korean government.[1] The group has been active since at least 2009 and was reportedly responsible for the November 2014 destructive wiper attack against Sony Pictures Entertainment as part of a campaign named Operation Blockbuster by Novetta. Malware used by Lazarus Group correlates to other reported campaigns, including Operation Flame, Operation 1Mission, Operation Troy, DarkSeoul, and Ten Days of Rain. [2] In late 2017, Lazarus Group used KillDisk, a disk-wiping tool, in an attack against an online casino based in Central America. [3]\nNorth Korean group definitions are known to have significant overlap, and the name Lazarus Group is known to encompass a broad range of activity. Some organizations use the name Lazarus Group to refer to any activity attributed to North Korea.[1] Some organizations track North Korean clusters or groups such as Bluenoroff,[4] APT37, and APT38 separately, while other organizations may track some activity associated with those group names by the name Lazarus Group.\n", "ID": "G0032", "Associated Groups": "HIDDEN COBRA, Guardians of Peace, ZINC, NICKEL ACADEMY", "Version": "1.2", "Created": "31 May 2017", "Last Modified": "04 October 2019"}}, {"name": "Leafminer", "url": "https://attack.mitre.org/groups/G0077", "source_keyword": "mitre-groups", "info": {"decription": "\nLeafminer is an Iranian threat group that has targeted government organizations and business entities in the Middle East since at least early 2017. [1]\n", "ID": "G0077", "Associated Groups": "Raspite", "Version": "2.1", "Created": "17 October 2018", "Last Modified": "05 October 2019"}}, {"name": "Leviathan", "url": "https://attack.mitre.org/groups/G0065", "source_keyword": "mitre-groups", "info": {"decription": "\nLeviathan is a cyber espionage group that has been active since at least 2013. The group generally targets defense and government organizations, but has also targeted a range of industries including engineering firms, shipping and transportation, manufacturing, defense, government offices, and research universities in the United States, Western Europe, and along the South China Sea. [1] [2]\n", "ID": "G0065", "Associated Groups": "TEMP.Jumper, APT40, TEMP.Periscope", "Contributors": "Valerii Marchuk, Cybersecurity Help s.r.o.", "Version": "2.0", "Created": "18 April 2018", "Last Modified": "23 September 2019"}}, {"name": "Lotus Blossom", "url": "https://attack.mitre.org/groups/G0030", "source_keyword": "mitre-groups", "info": {"decription": "\nLotus Blossom is a threat group that has targeted government and military organizations in Southeast Asia. [1]\n", "ID": "G0030", "Associated Groups": "DRAGONFISH, Spring Dragon", "Version": "2.0", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "Machete", "url": "https://attack.mitre.org/groups/G0095", "source_keyword": "mitre-groups", "info": {"decription": "\nMachete is a group that has been active since at least 2010, targeting high-profile government entities in Latin American countries.[1][2][3]\n", "ID": "G0095", "Associated Groups": "El Machete", "Contributors": "Matias Nicolas Porolli, ESET", "Version": "1.0", "Created": "13 September 2019", "Last Modified": "15 October 2019"}}, {"name": "Magic Hound", "url": "https://attack.mitre.org/groups/G0059", "source_keyword": "mitre-groups", "info": {"decription": "\nMagic Hound is an Iranian-sponsored threat group operating primarily in the Middle East that dates back as early as 2014. The group behind the campaign has primarily targeted organizations in the energy, government, and technology sectors that are either based or have business interests in Saudi Arabia.[1][2]\n", "ID": "G0059", "Associated Groups": "Rocket Kitten, Operation Saffron Rose, Ajax Security Team, Operation Woolen-Goldfish, Newscaster, Cobalt Gypsy, APT35", "Contributors": "Bryan Lee", "Version": "1.1", "Created": "16 January 2018", "Last Modified": "15 October 2019"}}, {"name": "menuPass", "url": "https://attack.mitre.org/groups/G0045", "source_keyword": "mitre-groups", "info": {"decription": "\nmenuPass is a threat group that appears to originate from China and has been active since approximately 2009. The group has targeted healthcare, defense, aerospace, and government sectors, and has targeted Japanese victims since at least 2014. In 2016 and 2017, the group targeted managed IT service providers, manufacturing and mining companies, and a university. [1] [2] [3] [4] [5] [6]\n", "ID": "G0045", "Associated Groups": "Stone Panda, APT10, Red Apollo, CVNX, HOGFISH", "Contributors": "Edward Millington, Michael Cox", "Version": "1.3", "Created": "31 May 2017", "Last Modified": "14 October 2019"}}, {"name": "Moafee", "url": "https://attack.mitre.org/groups/G0002", "source_keyword": "mitre-groups", "info": {"decription": "\nMoafee is a threat group that appears to operate from the Guandong Province of China. Due to overlapping TTPs, including similar custom tools, Moafee is thought to have a direct or indirect relationship with the threat group DragonOK. [1]\n", "ID": "G0002", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "Molerats", "url": "https://attack.mitre.org/groups/G0021", "source_keyword": "mitre-groups", "info": {"decription": "\nMolerats is a politically-motivated threat group that has been operating since 2012. The group's victims have primarily been in the Middle East, Europe, and the United States. [1] [2]\n", "ID": "G0021", "Associated Groups": "Operation Molerats, Gaza Cybergang", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "MuddyWater", "url": "https://attack.mitre.org/groups/G0069", "source_keyword": "mitre-groups", "info": {"decription": "\nMuddyWater is an Iranian threat group that has primarily targeted Middle Eastern nations, and has also targeted European and North American nations. The group's victims are mainly in the telecommunications, government (IT services), and oil sectors. Activity from this group was previously linked to FIN7, but the group is believed to be a distinct group possibly motivated by espionage.[1][2][3]\n", "ID": "G0069", "Associated Groups": "Seedworm, TEMP.Zagros", "Version": "2.1", "Created": "18 April 2018", "Last Modified": "28 June 2019"}}, {"name": "Naikon", "url": "https://attack.mitre.org/groups/G0019", "source_keyword": "mitre-groups", "info": {"decription": "\nNaikon is a threat group that has focused on targets around the South China Sea. [1] The group has been attributed to the Chinese People’s Liberation Army’s (PLA) Chengdu Military Region Second Technical Reconnaissance Bureau (Military Unit Cover Designator 78020). [2] While Naikon shares some characteristics with APT30, the two groups do not appear to be exact matches. [3]\n", "ID": "G0019", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "10 April 2019"}}, {"name": "NEODYMIUM", "url": "https://attack.mitre.org/groups/G0055", "source_keyword": "mitre-groups", "info": {"decription": "\nNEODYMIUM is an activity group that conducted a campaign in May 2016 and has heavily targeted Turkish victims. The group has demonstrated similarity to another activity group called PROMETHIUM due to overlapping victim and campaign characteristics. [1] [2] NEODYMIUM is reportedly associated closely with BlackOasis operations, but evidence that the group names are aliases has not been identified. [3]\n", "ID": "G0055", "Version": "1.0", "Created": "16 January 2018", "Last Modified": "25 March 2019"}}, {"name": "Night Dragon", "url": "https://attack.mitre.org/groups/G0014", "source_keyword": "mitre-groups", "info": {"decription": "\nNight Dragon is a campaign name for activity involving a threat group that has conducted activity originating primarily in China. [1]\n", "ID": "G0014", "Version": "1.1", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "OilRig", "url": "https://attack.mitre.org/groups/G0049", "source_keyword": "mitre-groups", "info": {"decription": "\nOilRig is a suspected Iranian threat group that has targeted Middle Eastern and international victims since at least 2014. The group has targeted a variety of industries, including financial, government, energy, chemical, and telecommunications, and has largely focused its operations within the Middle East. It appears the group carries out supply chain attacks, leveraging the trust relationship between organizations to attack their primary targets. FireEye assesses that the group works on behalf of the Iranian government based on infrastructure details that contain references to Iran, use of Iranian infrastructure, and targeting that aligns with nation-state interests. [1] [2] [3] [4] [5] [6][7] This group was previously tracked under two distinct groups, APT34 and OilRig, but was combined due to additional reporting giving higher confidence about the overlap of the activity.\n", "ID": "G0049", "Associated Groups": "IRN2, HELIX KITTEN, APT34", "Contributors": "Robert Falcone, Bryan Lee", "Version": "1.2", "Created": "14 December 2017", "Last Modified": "15 October 2019"}}, {"name": "Orangeworm", "url": "https://attack.mitre.org/groups/G0071", "source_keyword": "mitre-groups", "info": {"decription": "\nOrangeworm is a group that has targeted organizations in the healthcare sector in the United States, Europe, and Asia since at least 2015, likely for the purpose of corporate espionage. [1]\n", "ID": "G0071", "Contributors": "Elger Vinicius S. Rodrigues, @elgervinicius, CYBINT Centre", "Version": "1.0", "Created": "17 October 2018", "Last Modified": "25 March 2019"}}, {"name": "Patchwork", "url": "https://attack.mitre.org/groups/G0040", "source_keyword": "mitre-groups", "info": {"decription": "\nPatchwork is a cyberespionage group that was first observed in December 2015. While the group has not been definitively attributed, circumstantial evidence suggests the group may be a pro-Indian or Indian entity. Patchwork has been seen targeting industries related to diplomatic and government agencies. Much of the code used by this group was copied and pasted from online forums. Patchwork was also seen operating spearphishing campaigns targeting U.S. think tank groups in March and April of 2018. [1] [2] [3] [4]\n", "ID": "G0040", "Associated Groups": "Dropping Elephant, Chinastrats, MONSOON, Operation Hangover", "Version": "1.1", "Created": "31 May 2017", "Last Modified": "11 July 2019"}}, {"name": "PittyTiger", "url": "https://attack.mitre.org/groups/G0011", "source_keyword": "mitre-groups", "info": {"decription": "\nPittyTiger is a threat group believed to operate out of China that uses multiple different types of malware to maintain command and control. [1] [2]\n", "ID": "G0011", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "PLATINUM", "url": "https://attack.mitre.org/groups/G0068", "source_keyword": "mitre-groups", "info": {"decription": "\nPLATINUM is an activity group that has targeted victims since at least 2009. The group has focused on targets associated with governments and related organizations in South and Southeast Asia. [1]\n", "ID": "G0068", "Contributors": "Ryan Becwar", "Version": "1.1", "Created": "18 April 2018", "Last Modified": "10 May 2019"}}, {"name": "Poseidon Group", "url": "https://attack.mitre.org/groups/G0033", "source_keyword": "mitre-groups", "info": {"decription": "\nPoseidon Group is a Portuguese-speaking threat group that has been active since at least 2005. The group has a history of using information exfiltrated from victims to blackmail victim companies into contracting the Poseidon Group as a security firm. [1]\n", "ID": "G0033", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "17 October 2018"}}, {"name": "PROMETHIUM", "url": "https://attack.mitre.org/groups/G0056", "source_keyword": "mitre-groups", "info": {"decription": "\nPROMETHIUM is an activity group that has been active since at least 2012. The group conducted a campaign in May 2016 and has heavily targeted Turkish victims. PROMETHIUM has demonstrated similarity to another activity group called NEODYMIUM due to overlapping victim and campaign characteristics. [1] [2]\n", "ID": "G0056", "Version": "1.0", "Created": "16 January 2018", "Last Modified": "25 March 2019"}}, {"name": "Putter Panda", "url": "https://attack.mitre.org/groups/G0024", "source_keyword": "mitre-groups", "info": {"decription": "\nPutter Panda is a Chinese threat group that has been attributed to Unit 61486 of the 12th Bureau of the PLA’s 3rd General Staff Department (GSD). [1]\n", "ID": "G0024", "Associated Groups": "APT2, MSUpdater", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "Rancor", "url": "https://attack.mitre.org/groups/G0075", "source_keyword": "mitre-groups", "info": {"decription": "\nRancor is a threat group that has led targeted campaigns against the South East Asia region. Rancor uses politically-motivated lures to entice victims to open malicious documents. [1]\n", "ID": "G0075", "Version": "1.1", "Created": "17 October 2018", "Last Modified": "25 April 2019"}}, {"name": "RTM", "url": "https://attack.mitre.org/groups/G0048", "source_keyword": "mitre-groups", "info": {"decription": "\nRTM is a cybercriminal group that has been active since at least 2015 and is primarily interested in users of remote banking systems in Russia and neighboring countries. The group uses a Trojan by the same name (RTM). [1]\n", "ID": "G0048", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "Sandworm Team", "url": "https://attack.mitre.org/groups/G0034", "source_keyword": "mitre-groups", "info": {"decription": "\nSandworm Team is a Russian cyber espionage group that has operated since approximately 2009. The group likely consists of Russian pro-hacktivists. Sandworm Team targets mainly Ukrainian entities associated with energy, industrial control systems, SCADA, government, and media. Sandworm Team has been linked to the Ukrainian energy sector attack in late 2015.\n [1] [2]\n", "ID": "G0034", "Associated Groups": "Quedagh, VOODOO BEAR", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "Scarlet Mimic", "url": "https://attack.mitre.org/groups/G0029", "source_keyword": "mitre-groups", "info": {"decription": "\nScarlet Mimic is a threat group that has targeted minority rights activists. This group has not been directly linked to a government source, but the group's motivations appear to overlap with those of the Chinese government. While there is some overlap between IP addresses used by Scarlet Mimic and Putter Panda, it has not been concluded that the groups are the same. [1]\n", "ID": "G0029", "Version": "1.1", "Created": "31 May 2017", "Last Modified": "22 April 2019"}}, {"name": "Silence", "url": "https://attack.mitre.org/groups/G0091", "source_keyword": "mitre-groups", "info": {"decription": "\nSilence is a financially motivated threat actor targeting financial institutions in different countries. The group was first seen in June 2016. Their main targets reside in Russia, Ukraine, Belarus, Azerbaijan, Poland and Kazakhstan. They compromised various banking systems, including the Russian Central Bank's Automated Workstation Client, ATMs, and card processing. [1][2] \n", "ID": "G0091", "Contributors": "Oleg Skulkin, Group-IB", "Version": "1.0", "Created": "24 May 2019", "Last Modified": "16 July 2019"}}, {"name": "SilverTerrier", "url": "https://attack.mitre.org/groups/G0083", "source_keyword": "mitre-groups", "info": {"decription": "\nSilverTerrier is a Nigerian threat group that has been seen active since 2014. SilverTerrier mainly targets organizations in high technology, higher education, and manufacturing.[1][2]\n", "ID": "G0083", "Version": "1.0", "Created": "29 January 2019", "Last Modified": "12 April 2019"}}, {"name": "Soft Cell", "url": "https://attack.mitre.org/groups/G0093", "source_keyword": "mitre-groups", "info": {"decription": "\nOperation Soft Cell is a group that is reportedly affiliated with China and is likely state-sponsored. The group has operated since at least 2012 and has compromised high-profile telecommunications networks.[1]\n", "ID": "G0093", "Contributors": "Cybereason Nocturnus, @nocturnus", "Version": "1.0", "Created": "18 July 2019", "Last Modified": "22 July 2019"}}, {"name": "Sowbug", "url": "https://attack.mitre.org/groups/G0054", "source_keyword": "mitre-groups", "info": {"decription": "\nSowbug is a threat group that has conducted targeted attacks against organizations in South America and Southeast Asia, particularly government entities, since at least 2015. [1]\n", "ID": "G0054", "Contributors": "Alan Neville, @abnev", "Version": "1.0", "Created": "16 January 2018", "Last Modified": "25 March 2019"}}, {"name": "Stealth Falcon", "url": "https://attack.mitre.org/groups/G0038", "source_keyword": "mitre-groups", "info": {"decription": "\nStealth Falcon is a threat group that has conducted targeted spyware attacks against Emirati journalists, activists, and dissidents since at least 2012. Circumstantial evidence suggests there could be a link between this group and the United Arab Emirates (UAE) government, but that has not been confirmed. [1]\n", "ID": "G0038", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "17 October 2018"}}, {"name": "Stolen Pencil", "url": "https://attack.mitre.org/groups/G0086", "source_keyword": "mitre-groups", "info": {"decription": "\nStolen Pencil is a threat group likely originating from DPRK that has been active since at least May 2018. The group appears to have targeted academic institutions, but its motives remain unclear.[1]\n", "ID": "G0086", "Version": "1.0", "Created": "05 February 2019", "Last Modified": "24 June 2019"}}, {"name": "Strider", "url": "https://attack.mitre.org/groups/G0041", "source_keyword": "mitre-groups", "info": {"decription": "\nStrider is a threat group that has been active since at least 2011 and has targeted victims in Russia, China, Sweden, Belgium, Iran, and Rwanda. [1] [2]\n", "ID": "G0041", "Associated Groups": "ProjectSauron", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "Suckfly", "url": "https://attack.mitre.org/groups/G0039", "source_keyword": "mitre-groups", "info": {"decription": "\nSuckfly is a China-based threat group that has been active since at least 2014. [1]\n", "ID": "G0039", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "TA459", "url": "https://attack.mitre.org/groups/G0062", "source_keyword": "mitre-groups", "info": {"decription": "\nTA459 is a threat group believed to operate out of China that has targeted countries including Russia, Belarus, Mongolia, and others. [1]\n", "ID": "G0062", "Contributors": "Valerii Marchuk, Cybersecurity Help s.r.o.", "Version": "1.0", "Created": "18 April 2018", "Last Modified": "25 March 2019"}}, {"name": "TA505", "url": "https://attack.mitre.org/groups/G0092", "source_keyword": "mitre-groups", "info": {"decription": "\nTA505 is a financially motivated threat group that has been active since at least 2014. The group is known for frequently changing malware and driving global trends in criminal malware distribution.[1][2][3]\n", "ID": "G0092", "Version": "1.0", "Created": "28 May 2019", "Last Modified": "24 June 2019"}}, {"name": "Taidoor", "url": "https://attack.mitre.org/groups/G0015", "source_keyword": "mitre-groups", "info": {"decription": "\nTaidoor is a threat group that has operated since at least 2009 and has primarily targeted the Taiwanese government. [1]\n", "ID": "G0015", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "17 October 2018"}}, {"name": "TEMP.Veles", "url": "https://attack.mitre.org/groups/G0088", "source_keyword": "mitre-groups", "info": {"decription": "\nTEMP.Veles is a Russia-based threat group that has targeted critical infrastructure. The group has been observed utilizing TRITON, a malware framework designed to manipulate industrial safety systems.[1][2][3]\n", "ID": "G0088", "Associated Groups": "XENOTIME", "Version": "1.0", "Created": "16 April 2019", "Last Modified": "29 April 2019"}}, {"name": "The White Company", "url": "https://attack.mitre.org/groups/G0089", "source_keyword": "mitre-groups", "info": {"decription": "\nThe White Company is a likely state-sponsored threat actor with advanced capabilities. From 2017 through 2018, the group led an espionage campaign called Operation Shaheen targeting government and military organizations in Pakistan.[1]\n", "ID": "G0089", "Version": "1.0", "Created": "02 May 2019", "Last Modified": "12 June 2019"}}, {"name": "Threat Group-1314", "url": "https://attack.mitre.org/groups/G0028", "source_keyword": "mitre-groups", "info": {"decription": "\nThreat Group-1314 is an unattributed threat group that has used compromised credentials to log into a victim's remote access infrastructure. [1]\n", "ID": "G0028", "Associated Groups": "TG-1314", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "Threat Group-3390", "url": "https://attack.mitre.org/groups/G0027", "source_keyword": "mitre-groups", "info": {"decription": "\nThreat Group-3390 is a Chinese threat group that has extensively used strategic Web compromises to target victims. [1] The group has been active since at least 2010 and has targeted organizations in the aerospace, government, defense, technology, energy, and manufacturing sectors. [2] [3]\n", "ID": "G0027", "Associated Groups": "TG-3390, Emissary Panda, BRONZE UNION, APT27, Iron Tiger, LuckyMouse", "Version": "1.2", "Created": "31 May 2017", "Last Modified": "15 October 2019"}}, {"name": "Thrip", "url": "https://attack.mitre.org/groups/G0076", "source_keyword": "mitre-groups", "info": {"decription": "\nThrip is an espionage group that has targeted satellite communications, telecoms, and defense contractor companies in the U.S. and Southeast Asia. The group uses custom malware as well as \"living off the land\" techniques. [1]\n", "ID": "G0076", "Version": "1.0", "Created": "17 October 2018", "Last Modified": "25 March 2019"}}, {"name": "Tropic Trooper", "url": "https://attack.mitre.org/groups/G0081", "source_keyword": "mitre-groups", "info": {"decription": "\nTropic Trooper is an unaffiliated threat group that has led targeted campaigns against targets in Taiwan, the Philippines, and Hong Kong. Tropic Trooper focuses on targeting government, healthcare, transportation, and high-tech industries and has been active since 2011.[1][2]\n", "ID": "G0081", "Associated Groups": "KeyBoy", "Contributors": "Edward Millington, Bart Parys", "Version": "1.2", "Created": "29 January 2019", "Last Modified": "14 October 2019"}}, {"name": "Turla", "url": "https://attack.mitre.org/groups/G0010", "source_keyword": "mitre-groups", "info": {"decription": "\nTurla is a Russian-based threat group that has infected victims in over 45 countries, spanning a range of industries including government, embassies, military, education, research and pharmaceutical companies since 2004. Heightened activity was seen in mid-2015. Turla is known for conducting watering hole and spearphishing campaigns and leveraging in-house tools and malware. Turla’s espionage platform is mainly used against Windows machines, but has also been seen used against macOS and Linux machines. [1] [2] [3] [4]\n", "ID": "G0010", "Associated Groups": "Waterbug, WhiteBear, VENOMOUS BEAR, Snake, Krypton", "Contributors": "Edward Millington", "Version": "1.2", "Created": "31 May 2017", "Last Modified": "14 July 2019"}}, {"name": "Winnti Group", "url": "https://attack.mitre.org/groups/G0044", "source_keyword": "mitre-groups", "info": {"decription": "\nWinnti Group is a threat group with Chinese origins that has been active since at least 2010. The group has heavily targeted the gaming industry, but it has also expanded the scope of its targeting. [1] [2] [3] Some reporting suggests a number of other groups, including Axiom, APT17, and Ke3chang, are closely linked to Winnti Group. [4]\n", "ID": "G0044", "Associated Groups": "Blackfly", "Contributors": "Edward Millington", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "25 March 2019"}}, {"name": "WIRTE", "url": "https://attack.mitre.org/groups/G0090", "source_keyword": "mitre-groups", "info": {"decription": "\nWIRTE is a threat group that has been active since at least August 2018. The group focuses on targeting Middle East defense and diplomats.[1]\n", "ID": "G0090", "Contributors": "Lab52 by S2 Grupo", "Version": "1.0", "Created": "24 May 2019", "Last Modified": "20 June 2019"}}]